uhnp/src/Reports/ОтчетПоПроизвольномуЗапросуВИБ/ОтчетПоПроизвольномуЗапросуВИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоПроизвольномуЗапросуВИБ</name>
  <attributes>
    <name>ИспользуемаяИБ</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабПравилаВычисленияПараметров</name>
    <type>
      <types>ValueTable</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Report>

uhnp/src/Reports/ОтчетПоПроизвольномуЗапросуВИБ/Forms/ФормаОтчета/Module.bsl
&НаСервере
Функция ОткрытьФормуОбъектаВИБ(Расшифровка)
	
	Возврат Новый Структура("ТипЗначения, Значение", Расшифровка.ТипОбъектаМетаданных+"Ссылка."+Расшифровка.ИмяОбъектаМетаданных, Расшифровка.Ссылка);
		
КонецФункции // ОткрытьДокументОперации()

&НаСервере
Процедура ВывестиОтчет()
	
	ОтчетОбъект=ПолучитьРабочийОбъект();
		
	ТабРезультат.Очистить();
		
	ТабРезультат.Вывести(ОтчетОбъект.СформироватьОтчет());
		
КонецПроцедуры // ВывестиОтчет()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтчетОбъект=РеквизитФормыВЗначение("Отчет");
	
	Если ТипЗнч(Параметры.ПравилаИспользованияПолейЗапроса)=Тип("Массив") Тогда
		
		ОтчетОбъект.ПравилаИспользованияПолейЗапроса=ПроцедурыПреобразованияДанныхУХ.ПолучитьТаблицуИзМассиваСтруктур(Параметры.ПравилаИспользованияПолейЗапроса);
		
	КонецЕсли;
	
	Если ТипЗнч(Параметры.ПравилаВычисленияПараметровЗапроса)=Тип("Массив") Тогда
		
		ОтчетОбъект.ПравилаВычисленияПараметровЗапроса=ПроцедурыПреобразованияДанныхУХ.ПолучитьТаблицуИзМассиваСтруктур(Параметры.ПравилаВычисленияПараметровЗапроса);
		
		Для Каждого Строка ИЗ ОтчетОбъект.ПравилаВычисленияПараметровЗапроса Цикл
			
			НоваяСтрока=ОтчетОбъект.ТабПравилаВычисленияПараметров.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка,,"УточнениеСпособаОпределения");
			
			НоваяСтрока.УточнениеСпособаОпределения=УправлениеОтчетамиУХ.ПолучитьЗначениеИзХранилища(Строка.УточнениеСпособаОпределения);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОтчетОбъект.ИспользуемаяИБ=Параметры.ИспользуемаяИБ;
	ОтчетОбъект.ТекстЗапроса=Параметры.ТекстЗапроса;
	
	ПоместитьРабочийОбъект(ОтчетОбъект);
	
	Если Параметры.ФормироватьПриОткрытии Тогда
		
         ВывестиОтчет();
		 
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьРабочийОбъект()
	
	РабочийОбъект=РеквизитФормыВЗначение("Отчет");
	РабочийОбъект.АдресХранилищаПеременныхДляРасчета=РабочийОбъектАдрес;
	РабочийОбъект.ВосстановитьПеременныеДляРасчета();
	
	Возврат РабочийОбъект;
		
КонецФункции // ПолучитьРабочийОбъект()

&НаСервере
Процедура ПоместитьРабочийОбъект(РабочийОбъект)
	
	РабочийОбъектАдрес=ПоместитьВоВременноеХранилище(РабочийОбъект.ПодготовитьСтруктуруПеременныхДляРасчета(),ЭтаФорма.УникальныйИдентификатор);
	ЗначениеВРеквизитФормы(РабочийОбъект,"Отчет");
				
КонецПроцедуры // ПолучитьРабочийОбъект()

&НаКлиенте
Процедура ТабРезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если ТипЗнч(Расшифровка)=Тип("Структура") Тогда
		
		СтандартнаяОбработка=Ложь;
		
		Если Расшифровка.Свойство("Ссылка") Тогда
			
			ДанныеОбъекта=ОткрытьФормуОбъектаВИБ(Расшифровка);
			
			Если ТипЗнч(ДанныеОбъекта)=Тип("Структура") Тогда
				
				ОткрытьФорму("ОбщаяФорма.ОтображениеЭлементаWS_Управляемая", Новый Структура("Расшифровка, ИспользуемаяИБ", ДанныеОбъекта, Отчет.ИспользуемаяИБ));

			КонецЕсли;
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
